export interface Station {
  uid: number;
  name: string;
}

export const TAIWAN_STATIONS: Station[] = [
  {
    "uid": 1620,
    "name": "二林"
  },
  {
    "uid": 1612,
    "name": "三義"
  },
  {
    "uid": 1590,
    "name": "土城"
  },
  {
    "uid": 1596,
    "name": "士林"
  },
  {
    "uid": 1601,
    "name": "大同"
  },
  {
    "uid": 14645,
    "name": "大城"
  },
  {
    "uid": 1603,
    "name": "大園"
  },
  {
    "uid": 1636,
    "name": "大寮"
  },
  {
    "uid": 1597,
    "name": "中山"
  },
  {
    "uid": 12580,
    "name": "中部 大甲"
  },
  {
    "uid": 12581,
    "name": "中部 大里"
  },
  {
    "uid": 12583,
    "name": "中部 太平"
  },
  {
    "uid": 12584,
    "name": "中部 文山"
  },
  {
    "uid": 12614,
    "name": "中部 台電 大肚"
  },
  {
    "uid": 12606,
    "name": "中部 台電 大觀"
  },
  {
    "uid": 12915,
    "name": "中部 台電 伸港"
  },
  {
    "uid": 12913,
    "name": "中部 台電 和美"
  },
  {
    "uid": 12911,
    "name": "中部 台電 東大"
  },
  {
    "uid": 12604,
    "name": "中部 台電 草屯"
  },
  {
    "uid": 12598,
    "name": "中部 台電 梧棲"
  },
  {
    "uid": 12597,
    "name": "中部 台電 清水"
  },
  {
    "uid": 12615,
    "name": "中部 台電 鹿港"
  },
  {
    "uid": 12912,
    "name": "中部 台電 福興"
  },
  {
    "uid": 12914,
    "name": "中部 台電 龍井"
  },
  {
    "uid": 12582,
    "name": "中部 后里"
  },
  {
    "uid": 12596,
    "name": "中部 烏日"
  },
  {
    "uid": 12585,
    "name": "中部 霧峰"
  },
  {
    "uid": 1652,
    "name": "中壢"
  },
  {
    "uid": 1634,
    "name": "仁武"
  },
  {
    "uid": 1622,
    "name": "斗六"
  },
  {
    "uid": 1650,
    "name": "冬山"
  },
  {
    "uid": 12588,
    "name": "北部 三峽"
  },
  {
    "uid": 12419,
    "name": "北部 大直"
  },
  {
    "uid": 13048,
    "name": "北部 中油 桃園 煉油廠 F4"
  },
  {
    "uid": 12903,
    "name": "北部 內壢國中"
  },
  {
    "uid": 13255,
    "name": "北部 天母"
  },
  {
    "uid": 12423,
    "name": "北部 木柵"
  },
  {
    "uid": 13757,
    "name": "北部 台電 七堵"
  },
  {
    "uid": 12590,
    "name": "北部 台電 八里"
  },
  {
    "uid": 12624,
    "name": "北部 台電 竹圍"
  },
  {
    "uid": 12591,
    "name": "北部 台電 坑口"
  },
  {
    "uid": 12592,
    "name": "北部 台電 沙崙"
  },
  {
    "uid": 13011,
    "name": "北部 台電 協和"
  },
  {
    "uid": 14647,
    "name": "北部 台電 林口"
  },
  {
    "uid": 12589,
    "name": "北部 向陽"
  },
  {
    "uid": 12420,
    "name": "北部 信義"
  },
  {
    "uid": 12902,
    "name": "北部 華亞科技園區"
  },
  {
    "uid": 12901,
    "name": "北部 新興國小"
  },
  {
    "uid": 12904,
    "name": "北部 觀音"
  },
  {
    "uid": 1599,
    "name": "古亭"
  },
  {
    "uid": 1626,
    "name": "台西"
  },
  {
    "uid": 1646,
    "name": "台東"
  },
  {
    "uid": 1631,
    "name": "台南"
  },
  {
    "uid": 1639,
    "name": "左營"
  },
  {
    "uid": 1605,
    "name": "平鎮"
  },
  {
    "uid": 1630,
    "name": "安南"
  },
  {
    "uid": 1625,
    "name": "朴子"
  },
  {
    "uid": 1587,
    "name": "汐止"
  },
  {
    "uid": 1653,
    "name": "竹山"
  },
  {
    "uid": 1608,
    "name": "竹東"
  },
  {
    "uid": 1617,
    "name": "西屯"
  },
  {
    "uid": 1614,
    "name": "沙鹿"
  },
  {
    "uid": 1649,
    "name": "宜蘭"
  },
  {
    "uid": 1616,
    "name": "忠明"
  },
  {
    "uid": 1591,
    "name": "板橋"
  },
  {
    "uid": 1594,
    "name": "林口"
  },
  {
    "uid": 1637,
    "name": "林園"
  },
  {
    "uid": 14646,
    "name": "花東 豐里"
  },
  {
    "uid": 1647,
    "name": "花蓮"
  },
  {
    "uid": 1658,
    "name": "金門"
  },
  {
    "uid": 1621,
    "name": "南投"
  },
  {
    "uid": 1643,
    "name": "屏東"
  },
  {
    "uid": 1645,
    "name": "恆春"
  },
  {
    "uid": 1632,
    "name": "美濃"
  },
  {
    "uid": 1611,
    "name": "苗栗"
  },
  {
    "uid": 1656,
    "name": "埔里"
  },
  {
    "uid": 1602,
    "name": "桃園"
  },
  {
    "uid": 1659,
    "name": "馬公"
  },
  {
    "uid": 13760,
    "name": "高屏"
  },
  {
    "uid": 12618,
    "name": "高屏 中油 林園 Q1"
  },
  {
    "uid": 12601,
    "name": "高屏 中鋼 A 廠"
  },
  {
    "uid": 12602,
    "name": "高屏 中鋼 C 廠"
  },
  {
    "uid": 12909,
    "name": "高屏 中鋼 F 廠"
  },
  {
    "uid": 12619,
    "name": "高屏 台電 文南"
  },
  {
    "uid": 12620,
    "name": "高屏 台電 文賢"
  },
  {
    "uid": 12622,
    "name": "高屏 台電 茄萣"
  },
  {
    "uid": 12621,
    "name": "高屏 台電 鹽田"
  },
  {
    "uid": 13758,
    "name": "高屏 基隆港信號台"
  },
  {
    "uid": 12910,
    "name": "高屏 愛國國小"
  },
  {
    "uid": 12586,
    "name": "高屏 燕洲"
  },
  {
    "uid": 1586,
    "name": "基隆"
  },
  {
    "uid": 1623,
    "name": "崙背"
  },
  {
    "uid": 1595,
    "name": "淡水"
  },
  {
    "uid": 1661,
    "name": "麥寮"
  },
  {
    "uid": 1629,
    "name": "善化"
  },
  {
    "uid": 11194,
    "name": "富貴角"
  },
  {
    "uid": 1655,
    "name": "復興"
  },
  {
    "uid": 1607,
    "name": "湖口"
  },
  {
    "uid": 1593,
    "name": "菜寮"
  },
  {
    "uid": 1648,
    "name": "陽明"
  },
  {
    "uid": 12951,
    "name": "雲嘉南 虎尾"
  },
  {
    "uid": 12593,
    "name": "雲嘉南 城西里"
  },
  {
    "uid": 12594,
    "name": "雲嘉南 楠西"
  },
  {
    "uid": 1609,
    "name": "新竹"
  },
  {
    "uid": 1589,
    "name": "新店"
  },
  {
    "uid": 1592,
    "name": "新莊"
  },
  {
    "uid": 1624,
    "name": "新港"
  },
  {
    "uid": 1628,
    "name": "新營"
  },
  {
    "uid": 1638,
    "name": "楠梓"
  },
  {
    "uid": 1598,
    "name": "萬華"
  },
  {
    "uid": 1627,
    "name": "嘉義"
  },
  {
    "uid": 1618,
    "name": "彰化"
  },
  {
    "uid": 1635,
    "name": "鳳山"
  },
  {
    "uid": 1644,
    "name": "潮州"
  },
  {
    "uid": 1619,
    "name": "線西"
  },
  {
    "uid": 1633,
    "name": "橋頭"
  },
  {
    "uid": 1610,
    "name": "頭份"
  },
  {
    "uid": 1606,
    "name": "龍潭"
  },
  {
    "uid": 1613,
    "name": "豐原"
  },
  {
    "uid": 12617,
    "name": "離島 台電 尖山"
  },
  {
    "uid": 12916,
    "name": "離島 台電 菓葉"
  },
  {
    "uid": 12616,
    "name": "離島 台電 新仁"
  },
  {
    "uid": 1660,
    "name": "關山"
  },
  {
    "uid": 1604,
    "name": "觀音"
  }
];
